//
//  ProgramsArray.swift
//  Steel weight
//
//  Created by Danya on 08.08.2021.
//

import Foundation

//MARK: - ProgramsArray

let programsNameArray = ["Разминка", "Знакомство с гирей", "Все тело",
                         "Продвинутая", "Мышцы кора"]

let programsImageArray = ["warmup", "basic", "body","professional",
                          "core"]

//MARK: - WarmupArray

let warmapNameArray = ["Наклоны головы", "Круговые вращения головой", "Вращения плечами",
                       "Круговые вращения руками", "Вращения предплечий", "Вращения в кистях",
                       "Наклоны", "Круговые движения тазом",
                       "Вращение коленей", "Приседания без веса", "Подъем на носки"]

let warmupRepetArray = ["x8", "x8", "x10", "x10", "x10", "x10",
                        "x8", "x10", "x10", "x10", "x10"]

//MARK: - BasicArray

let groupSectionBasic = ["Неделя первая", "Неделя вторая", "Неделя третья"]

let dayTreningBasic = [
    ["День 1", "День 2"],
    ["День 1", "День 2"],
    ["День 1", "День 2"]
]

let musculeBasic = [
    ["Спина, Ноги, Плечи", "Спина, Ноги, Плечи, Пресс"],
    ["Грудь, Бицепс, Пресс, Трицепс", "Спина, Ноги, Плечи"],
    ["Спина, Ноги, Плечи, Пресс", "Грудь, Бицепс, Пресс, Трицепс"]
]

//MARK: - BodyArray

let groupSectionBody = ["Неделя первая", "Неделя вторая", "Неделя третья", "Неделя четвертая"]

let dayTreningBody = [
    ["День 1", "День 2"],
    ["День 1", "День 2"],
    ["День 1", "День 2"],
    ["День 1", "День 2"]
]

let musculeBody = [
    ["Спина, Ноги, Плечи", "Спина, Ноги, Плечи, Пресс"],
    ["Грудь, Бицепс, Пресс, Трицепс", "Спина, Ноги, Плечи"],
    ["Спина, Ноги, Плечи, Пресс", "Грудь, Бицепс, Пресс, Трицепс"],
    ["Спина, Ноги, Плечи", "Спина, Ноги, Плечи, Пресс"]
]


